app/nvmf_iaa/fio_engine/results_lat/8k_latency.out
=== run_latency.sh ===
timestamp: 2026-04-06 19:32:29
bs: 8k
size: 8k
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: ./iaanic.so
poll_usleep: 0
write_phase: (g=0): rw=write, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=snic_phase1, iodepth=1
read_phase: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 2 threads
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x773404114040 size=1568
[Init] DECOMP AECS loaded: addr=0x773404119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x773404114040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x773404119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

write_phase: (groupid=0, jobs=1): err= 0: pid=143162: Mon Apr  6 19:32:30 2026
  write: IOPS=1000, BW=8000KiB/s (8192kB/s)(8192B/1msec)
    clat (nsec): min=87342, max=87342, avg=87342.00, stdev= 0.00
     lat (nsec): min=88633, max=88633, avg=88633.00, stdev= 0.00
    clat percentiles (nsec):
     |  1.00th=[87552],  5.00th=[87552], 10.00th=[87552], 20.00th=[87552],
     | 30.00th=[87552], 40.00th=[87552], 50.00th=[87552], 60.00th=[87552],
     | 70.00th=[87552], 80.00th=[87552], 90.00th=[87552], 95.00th=[87552],
     | 99.00th=[87552], 99.50th=[87552], 99.90th=[87552], 99.95th=[87552],
     | 99.99th=[87552]
  lat (usec)   : 100=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=0, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1
read_phase: (groupid=0, jobs=1): err= 0: pid=143163: Mon Apr  6 19:32:30 2026
  read: IOPS=1000, BW=8000KiB/s (8192kB/s)(8192B/1msec)
    clat (nsec): min=86142, max=86142, avg=86142.00, stdev= 0.00
     lat (nsec): min=86894, max=86894, avg=86894.00, stdev= 0.00
    clat percentiles (nsec):
     |  1.00th=[86528],  5.00th=[86528], 10.00th=[86528], 20.00th=[86528],
     | 30.00th=[86528], 40.00th=[86528], 50.00th=[86528], 60.00th=[86528],
     | 70.00th=[86528], 80.00th=[86528], 90.00th=[86528], 95.00th=[86528],
     | 99.00th=[86528], 99.50th=[86528], 99.90th=[86528], 99.95th=[86528],
     | 99.99th=[86528]
  lat (usec)   : 100=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=0, majf=0, minf=5
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=8000KiB/s (8192kB/s), 8000KiB/s-8000KiB/s (8192kB/s-8192kB/s), io=8192B (8192B), run=1-1msec
  WRITE: bw=8000KiB/s (8192kB/s), 8000KiB/s-8000KiB/s (8192kB/s-8192kB/s), io=8192B (8192B), run=1-1msec